//===========================================================
// 该类是一个定义各种字符串正则表达式字符串的枚举类
// 还没有完成
//
// @enum
// @author maochunyang
// @version 1.0.1
//===========================================================
MO.ERegExp = new function ERegExp(){
   var o = this;
   /// 是整数
   o.I                   = /^-?[1-9]\d*|0$/;
   /// 是正整数
   o.PI                  = /^[1-9]\d*$/;
   /// 是负整数
   o.NI                  = /^-[1-9]\d*$/;
   /// 是浮点数 ?
   o.F                   = /^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$/;
   /// 是正浮点数 ?
   o.PF                  = /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$/;
   /// 是负浮点数 ?
   o.NF                  = /^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$/;
   /// 是URL地址 ?
   o.U                   = /[1-9]{1}[0-9]/;
   /// 是邮件地址
   o.E                   = /^\w{1,}[@]{1}[a-zA-Z]{1,}[.]{1}[a-zA-Z]{1,}$/;
   return o;
}
